analysis/simulation/simpleExample/exampleOFsimulation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>"How to simulate data with three clusters from real data"</title>
<!-- 2016-02-07 Sun 21:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Heejung Shim" />
</head>
<body>
<div id="content">
<h1 class="title">"How to simulate data with three clusters from real data"</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Simulation scheme</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Ideas for simulating data from real data has been described in Chapter 5 in Supplementary Material of <a href="http://projecteuclid.org/euclid.aoas/1437397106">Shim and Stephens 2015</a>. We will use DNase-seq data presented in <a href="http://projecteuclid.org/euclid.aoas/1437397106">Shim and Stephens 2015</a>.
You can obtain data from <a href="https://github.com/heejungshim/WaveQTL">WaveQTL repo</a>. Simulation scheme uses functions provided in <a href="https://github.com/heejungshim/utils_shim/">utils_shim repo</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Simulation scheme</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-R">## set up working directory (you need to change this).
setwd('/home/hjshim/d/projects/HTS-Clustering');

## read path to repositories 
WaveQTL.repodir =scan(".WaveQTL.repodir.txt",what=character())
utils_shim.repodir =scan(".utils_shim.repodir.txt",what=character())

## read functions for simulation. We will use a function `sample.from.Binomial.with.Overdispersion'. See the file for detaied description of arguments.
source(paste0(utils_shim.repodir, "/R/utils_multiscale.R"))

## read DNase-seq data. This DNase-seq data has been obtained as average of two strands. For simulation, we convert them to count data. 
pheno.dat = as.matrix(read.table(paste0(WaveQTL.repodir, "/data/dsQTL/chr17.10160989.10162012.pheno.dat")))
pheno.dat = ceiling(pheno.dat)

## read genotype data and convert them to three genotypes
sel_geno_IX = 11
geno.dat = as.numeric(read.table(paste0(WaveQTL.repodir, "/data/dsQTL/chr17.10160989.10162012.2kb.cis.geno"), as.is = TRUE)[sel_geno_IX, -(1:3)])
geno.dat = round(geno.dat)
table(geno.dat)
## geno.dat
##  0  1  2 
## 28 30 12 

## create three DNase-seq data sets for three genotypes.
DNase0 = pheno.dat[geno.dat==0,]
DNase1 = pheno.dat[geno.dat==1,]
DNase2 = pheno.dat[geno.dat==2,]

## sample 10 curves from each cluster. I put over.dispersion = 0.001, but you could chnage this value. 
num.sam = 10
DNase = DNase0
total.count = as.numeric(apply(DNase, 2, sum))
mu.sig = rep(1/dim(DNase)[1], dim(DNase)[2])
over.dispersion=0.001
data0 = sample.from.Binomial.with.Overdispersion(num.sam, total.count, mu.sig, over.dispersion)

num.sam = 10
DNase = DNase1
total.count = as.numeric(apply(DNase, 2, sum))
mu.sig = rep(1/dim(DNase)[1], dim(DNase)[2])
over.dispersion=0.001
data1 = sample.from.Binomial.with.Overdispersion(num.sam, total.count, mu.sig, over.dispersion)

num.sam = 10
DNase = DNase2
total.count = as.numeric(apply(DNase, 2, sum))
mu.sig = rep(1/dim(DNase)[1], dim(DNase)[2])
over.dispersion=0.001
data2 = sample.from.Binomial.with.Overdispersion(num.sam, total.count, mu.sig, over.dispersion)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Heejung Shim</p>
<p class="date">Created: 2016-02-07 Sun 21:07</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
